app/Http/Controllers/TaskController.php

    public function create(Request $request)
    {
        $targets = Target::get();

        $departments = (request()->user()->hasROle('DEPARTMENT_HEAD') ? [request()->user()->headOf] :  request()->user()->hasROle('EMPLOYEE')) ? [] : Department::get();

        $parent_tasks = Task::get();

        $users = request()->user()->hasROle('DEPARTMENT_HEAD') ? request()->user()->headOf->users : (request()->user()->hasRole('EMPLOYEE') ? [] : User::get());

        $forToday = (bool) request()->query('dailyTask') === true ? Carbon::now()->format('Y-m-d') : null;

        $fortnights = Fortnight::get();
---
select * from `targets`
select * from `tasks`
select * from `fortnights`